Revit 2027 API
DimensionSegmentArray Constructor
Initializes a new instance of the DimensionSegmentArray class
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public DimensionSegmentArray()
Public Sub New
public:
DimensionSegmentArray()
new : unit -> DimensionSegmentArray
See Also
Reference
DimensionSegmentArray Class
Autodesk.Revit.DB Namespace